//------------------------------------------------------
// Вершинный шейдер
//------------------------------------------------------
float4 VS(float4 Pos : POSITION) : SV_POSITION
{
	// Оставляем координаты точек без именения
	return Pos;
}

//------------------------------------------------------
// Пиксельный шейдер
//------------------------------------------------------
float4 PS(float4 Pos : POSITION) : SV_Target
{
	// Возвращаем желтый непрозрачный цвет (альфа == 1, канал альфа не включен)
	return float4(1.0f, 1.0f, 0.0f, 1.0f);
}

void main()
{
	
}